Autodesk.Revit.DB.PropertyTableEntryArcDirection
An enumerated type that represents the arc directions supported in an Arc table entry for a PropertyLine element.
Since:
2027

Autodesk.Revit.DB.PropertyTableEntryArcDirection.Right
The arc proceeds to the right of the corresponding line segment.

Autodesk.Revit.DB.PropertyTableEntryArcDirection.Left
The arc proceeds to the left of the corresponding line segment.